---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForFloor
source: html/f54f41a7-f667-807a-6fdc-f352d91b8b82.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidSketchForFloor Property

Floor sketch is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketchForFloor { get; }
```